"""
서비스 설명 기재 (최초로 진입하는 페이지)
"""

import streamlit as st

st.title("💭 UpThink")
st.caption("지식을 정리하는 사고에만 집중해 보세요!")

st.markdown("""### 개요
지식을 정리할 때 태그 스타일링, 연관 노트 탐색 등 번거로운 정리 작업에 상당한 인지적인 비용을 소모하며, 정작 가장 중요한 사고의 흐름이 끊기는 문제가 발생하게 됩니다. \\
또한, 사용자가 직접 연결하지 않은 노트들은 정보의 섬처럼 고립되어, 과거의 중요한 아이디어나 지식이 잊혀지는 문제가 발생합니다.

UpThink는 이러한 문제들을 해결하기 위한 지식 관리 서비스입니다.
본 서비스를 통해 정리의 부담에서 벗어나, 가장 중요한 사고 활동에 몰입할 수 있으며 자신의 지식 속에서 숨겨진 인사이트를 발견할 수 있습니다.
""")

st.markdown("""### 서비스 기능
##### 1️⃣ 이미지 대체 텍스트 생성
- .

##### 2️⃣ 태그 추천
- .

##### 3️⃣ 연관 노트 추천
- .

##### 4️⃣ 노트 분할
- .
""")